app/controllers/comments_controller.rb

    def new
        movie_id = params[:movie_id]
        m = Movie.find(movie_id)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]