app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (summary LIKE '%thor%') ORDER BY created_at DESC
---
  def index
    @movies = Movie.all

DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 33]]
---
  def destroy
    unless is_admin?
      redirect_to request.referrer
    end

    @movie.destroy