app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "zxc"], ["created_at", 2017-05-22 01:24:34 UTC], ["updated_at", 2017-05-22 01:24:34 UTC], ["password_digest", "$2a$10$DDWUBzWW7MZnDp72hoxxQ.VMITrvRrqqiVdRQzZ8ZdM2T68RJ.nka"]]